blog/artificial-universe-engineering.project.org
#+TITLE: Becoming
#+DATE: <2023-08-22 Tue>
#+SUBTITLE: Engineering the Protoverse
#+LANGUAGE: en
#+DESCRIPTION: Let's build an artificial universe from scratch.
#+KEYWORDS: computational philosophy, metaphysics, universal darwinism, alife, natural selection, emergence, nonlinear dynamic systems, chaos theory
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/embedded-universe-engineering.project.html">
#+SETUPFILE: ../static/setup.org
#+OPTIONS: toc:3

#+begin_box
*WORK IN PROGRESS ---* The aim here is to think about modeling, technical requirements and to identify helpful tools and skills. If you would like to ponder ideas, I'll be happy to chat.
#+end_box

* Prelude

The Protoverse is not made from things (like particles or objects and such), but Processes (with capital 'P'). What we typically conceive of as stable entities ("things") are actually temporary aggregations of Processes and their interactions -- it's Processes all the way down. Process is the prime abstraction; uniform primitive Processes can emerge into higher-order Processes. The process-relational Protoverse is [[https://en.wikipedia.org/wiki/Background_independence][backdrop-independent]]; hence there's no a-priori time, space or gravity -- but that kind of stuff could theoretically /evolve/, darwin-style.

Protoverse Processes become their own "computing substrate". As an example -- it's quite like cellular automata work, where the grid is not a pre-defined "space", but each cell's state at a given step is determined by the states of its neighbouring cells at the previous step, so that the structure of the grid is inherently linked to the operation of the automaton (this aspect is often overlooked when playing with a cellular automata within apps, as the cellular automata are always displayed in an area of a certain size).

* Modeling Dynamic Structures

The Protoverse has to run on digital computers, since we don't have anything more sophisticated yet. Computers operate with discrete structures -- so it would be generally easier to stick to discrete structures. But actually, I'm quite fond of fundamentally continuous structures, because the (necessary) discretization could elegantly introduce the notion of uncertainty and approximation, [[file:artificial-universe-metaphysics.project.org][as elaborated in metaphysical framework]]. Let's look at some ideas:

** Cellular Automata (n-dimensional)
Cells could be multidimensional, and also can have more than just binary ("on/off") states. Cellular automata allow for efficient parallel computation, because each cell's state depends only on its local neighboorhood, and their states are updated simultaneously. Cellular automata may not fit well, because they're inherently tied to discrete steps and a rigid a-priori concept of time and locality (well, that could be migitated by the rules -- it solely depends on how many layers one is willing to pile up on another).

** Graph- or Hypergraph Rewriting
Hypergraphs offer higher flexibility to encode (non-local) relations and interactions. Eventually, one would not just use "a hypergraph", but utilize evolving graph structures with constraints and update functions to enable and encode evolutionary dynamics. Graphs lend themselves to recursive/fractals-like structures, which corresponds to modeling nested emergent scales.

** Higher-order Functions and Function Composition
The idea here is to put aside structures like cellular automata and hypergraphs, but use just functions for dynamically evolving structures. That's pretty wild and requires careful design. Functions are idiomatic/first class in most languages, which poses little overhead — and eventually, we may end up with some kind of a graph anyway (or an unintelligible mess), because we're just abstracting the notion of structure into the behavior of functions themselves.

** Language Oriented Programming (DSL)
The idea here is to have a language representation that is subject to be utilized and evolved directly by the Protoverse Processes ("data is code, code is data"). /Everything/ then would happen on the /language level/, abstracting from stuff like functions, data structures, etc. That would certainly add semanic denseness due to the initially high level. A clearer separation of the high-level design from the lower-level implementation is appealing. The feedback loop involving design and implementation must be very tight, otherwise challenging implementation issues could show up that require extensive pivots.

