blog/artificial-universe-engineering.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-02 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Becoming</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Let's build an artificial universe from scratch." />
<meta name="keywords" content="computational philosophy, metaphysics, universal darwinism, alife, natural selection, emergence, nonlinear dynamic systems, chaos theory" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/mononoki/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/embedded-universe-engineering.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2024-02-01">Last updated: 2024-02-01</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Becoming</h1>
<p class="subtitle" role="doc-subtitle">Engineering the Protoverse</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4edac65">Prelude</a></li>
<li><a href="#org08eac7f">Modeling Dynamic Structures</a>
<ul>
<li><a href="#org4703170">Cellular Automata (n-dimensional)</a></li>
<li><a href="#org547bfe9">Graph- or Hypergraph Rewriting</a></li>
<li><a href="#org6d6aa3a">Higher-order Functions and Function Composition</a></li>
<li><a href="#org31cbcb6">Language Oriented Programming (DSL)</a></li>
<li><a href="#orgc13a6b9">Build upon an Adopted, Adapted or Self-designed Process Calculus</a>
<ul>
<li><a href="#org1515be5">Bigraphs</a></li>
</ul>
</li>
<li><a href="#org659519e">&#x2026; Better Ideas?</a></li>
</ul>
</li>
<li><a href="#orgfb40a23">Requirements</a>
<ul>
<li><a href="#org805ebe7">From Metaphysics to Code</a></li>
<li><a href="#org9aee9a2">Creation and Use of Embedded DSLs</a></li>
<li><a href="#org8e5fa14">Exploratory Programming</a></li>
<li><a href="#orgefcfc9f">Live Coding</a></li>
<li><a href="#org3e0d56b">Recursion Support</a></li>
<li><a href="#orga3adb43">Infinite Structures</a></li>
<li><a href="#org585fabb">Process Calculi</a></li>
<li><a href="#org0226302">Concurrency</a></li>
<li><a href="#org8577188">Parallelism</a></li>
<li><a href="#orgd86e030">OpenCL or CUDA Bindings</a></li>
<li><a href="#org80f629e">Interfacing With other Ecosystems</a></li>
<li><a href="#orgad2d05f">Visualization, Analysis and Profiling</a></li>
<li><a href="#orge224263">Scaling</a></li>
<li><a href="#org34a2894">Distributed Computing</a></li>
<li><a href="#org15ad55d">Fault tolerance</a></li>
<li><a href="#orgb3d730c">Pruning and Data Compression</a></li>
<li><a href="#orgdabdc7c">Collaboration Opportunities</a></li>
</ul>
</li>
<li><a href="#org0f7d4fd">Core Programming Language</a>
<ul>
<li><a href="#org4eea73e">1. Erlang: Elixir</a></li>
<li><a href="#org551e15b">2. Haskell</a></li>
<li><a href="#org8509f78">3. OCaml</a></li>
<li><a href="#orgd91d60c">4. Common Lisp (SBCL)</a></li>
<li><a href="#orgc4a12a6">5. Julia</a></li>
<li><a href="#org42fef09">6. Clojure</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div class="box" id="org2999400">
<p>
<b>WORK IN PROGRESS ---</b> The aim here is to think about modeling, technical requirements and to identify helpful tools and skills. If you would like to ponder ideas, I&rsquo;ll be happy to chat.<br>
</p>

</div>

<div id="outline-container-org4edac65" class="outline-2">
<h2 id="org4edac65"><a href="#org4edac65">Prelude</a></h2>
<div class="outline-text-2" id="text-org4edac65">
<p>
The Protoverse is not made from things (like particles or objects and such), but Processes (with capital &rsquo;P&rsquo;). What we typically conceive of as stable entities (&ldquo;things&rdquo;) are actually temporary aggregations of Processes and their interactions &#x2013; it&rsquo;s Processes all the way down. Process is the prime abstraction; uniform primitive Processes can emerge into higher-order Processes. The process-relational Protoverse is <a href="https://en.wikipedia.org/wiki/Background_independence">backdrop-independent</a>; hence there&rsquo;s no a-priori time, space or gravity &#x2013; but that kind of stuff could theoretically <i>evolve</i>, darwin-style.<br>
</p>

<p>
Protoverse Processes become their own &ldquo;computing substrate&rdquo;. As an example &#x2013; it&rsquo;s quite like cellular automata work, where the grid is not a pre-defined &ldquo;space&rdquo;, but each cell&rsquo;s state at a given step is determined by the states of its neighbouring cells at the previous step, so that the structure of the grid is inherently linked to the operation of the automaton (this aspect is often overlooked when playing with a cellular automata within apps, as the cellular automata are always displayed in an area of a certain size).<br>
</p>
</div>
</div>

<div id="outline-container-org08eac7f" class="outline-2">
<h2 id="org08eac7f"><a href="#org08eac7f">Modeling Dynamic Structures</a></h2>
<div class="outline-text-2" id="text-org08eac7f">
<p>
The Protoverse has to run on digital computers, since we don&rsquo;t have anything more sophisticated yet. Computers operate with discrete structures &#x2013; so it would be generally easier to stick to discrete structures. But actually, I&rsquo;m quite fond of fundamentally continuous structures, because the (necessary) discretization could elegantly introduce the notion of uncertainty and approximation, <a href="artificial-universe-metaphysics.project.html">as elaborated in metaphysical framework</a>. Let&rsquo;s look at some ideas:<br>
</p>
</div>

<div id="outline-container-org4703170" class="outline-3">
<h3 id="org4703170"><a href="#org4703170">Cellular Automata (n-dimensional)</a></h3>
<div class="outline-text-3" id="text-org4703170">
<p>
Cells could be multidimensional, and also can have more than just binary (&ldquo;on/off&rdquo;) states. Cellular automata allow for efficient parallel computation, because each cell&rsquo;s state depends only on its local neighboorhood, and their states are updated simultaneously. Cellular automata may not fit well, because they&rsquo;re inherently tied to discrete steps and a rigid a-priori concept of time and locality (well, that could be migitated by the rules &#x2013; it solely depends on how many layers one is willing to pile up on another).<br>
</p>
</div>
</div>

<div id="outline-container-org547bfe9" class="outline-3">
<h3 id="org547bfe9"><a href="#org547bfe9">Graph- or Hypergraph Rewriting</a></h3>
<div class="outline-text-3" id="text-org547bfe9">
<p>
Hypergraphs offer higher flexibility to encode (non-local) relations and interactions. Eventually, one would not just use &ldquo;a hypergraph&rdquo;, but utilize evolving graph structures with constraints and update functions to enable and encode evolutionary dynamics. Graphs lend themselves to recursive/fractals-like structures, which corresponds to modeling nested emergent scales.<br>
</p>
</div>
</div>

<div id="outline-container-org6d6aa3a" class="outline-3">
<h3 id="org6d6aa3a"><a href="#org6d6aa3a">Higher-order Functions and Function Composition</a></h3>
<div class="outline-text-3" id="text-org6d6aa3a">
<p>
The idea here is to put aside structures like cellular automata and hypergraphs, but use just functions for dynamically evolving structures. That&rsquo;s pretty wild and requires careful design. Functions are idiomatic/first class in most languages, which poses little overhead — and eventually, we may end up with some kind of a graph anyway (or an unintelligible mess), because we&rsquo;re just abstracting the notion of structure into the behavior of functions themselves.<br>
</p>
</div>
</div>

<div id="outline-container-org31cbcb6" class="outline-3">
<h3 id="org31cbcb6"><a href="#org31cbcb6">Language Oriented Programming (DSL)</a></h3>
<div class="outline-text-3" id="text-org31cbcb6">
<p>
The idea here is to have a language representation that is subject to be utilized and evolved directly by the Protoverse Processes (&ldquo;data is code, code is data&rdquo;). <i>Everything</i> then would happen on the <i>language level</i>, abstracting from stuff like functions, data structures, etc. That would certainly add semanic denseness due to the initially high level. A clearer separation of the high-level design from the lower-level implementation is appealing. The feedback loop involving design and implementation must be very tight, otherwise challenging implementation issues could show up that require extensive pivots.<br>
</p>
</div>
</div>
