blog/artificial-universe-engineering.project.org
** Build upon an Adopted, Adapted or Self-designed Process Calculus
A newcomer on this list: As per my current understanding, designing the Process abstraction and dynamics would result in something like a [[https://en.wikipedia.org/wiki/Process_calculus][process calculus]] anyway, just "ad hoc, informally specified, bug-ridden and half-assed".

I'm aware that process calculi or algebras are considered models of computation "for" concurreny, but that's just one (albeit important) aspect -- even more interesting is that process calculi are existing formal systems to express process-relational dynamics. That's has strong DSL potential (there seem to be some implementations also).

The idea is quite appealing, e.g. [[https://en.wikipedia.org/wiki/%CE%A0-calculus][π-calculus]]: there are /anonymous processes/ that communicate via named (or typed) channels. These channels can be passed around by processes through other channels, and this "mobility" allows dynamic reconfiguration of the process network. Processes can be composed into larger ones, which maps to the idea of "higher-order" Protoverse Processes. Channels might represent various "dimensions" for newly evolved means of relations (and interactions) of higher-order Processes.

There's a chance that I might conflate something and be mistaken with what I said above, since I've looked into process calculi only superficially as of yet. Before deep-diving, it seems rather sensible to advance the design of the Process abstraction by own reasoning first, and reconcile afterwards.

*** Bigraphs
Today I learned that the idea above, using channels like "dimensions" seems to be the gist of /bigraphs/, modeling both the connectivity between processes (communication links) and their placement within a spatial or hierarchical context separately (location). My intuition says that there wouldn't be two distinct entities neccessary, because uniform (but typed?) channels could also represent hierarchical contexts -- but I may be confusing things here.

** ... Better Ideas?
Let me know what you think. It would be great to juggle ideas, different points of view and fresh input.

* Requirements

** From Metaphysics to Code
To minimize context switching, the core langage should enable expressing the [[file:artificial-universe-metaphysics.project.org][fundamental dynamics]] closely and natively. A [[https://en.wikipedia.org/wiki/Purely_functional_programming][functional]] general-purpose language with metaprogramming and a flexible concurrency story in combination with bottom-up [[https://en.wikipedia.org/wiki/Logic_programming][logic programming]] might go a long way.

** Creation and Use of Embedded DSLs
It might be wishful thinking to achieve a close fit between code and the process-relational worldview with a general-purpose programming language alone. It's deemed necessary that unprecedented abstractions (e.g. a process calculus) can be created on top without hindrance, in form of a embedded DSL. Pivoting into different directions must be feasible (emphasis on refactoring capabilities and rather general primitives).

** Exploratory Programming
There will be no formal specification before the actual code, hence an exploratory programming style seems like the sanest approach for modeling. That sets the focus on primarily interactive use of language/platform.

** Live Coding
The programming environment/language should support conversational programming with the running live system. At this point, it's unclear how important this actually could become, relative to the tradeoffs -- because it greatly limits the number of potential programming languages. Further, increasingly interesting events are likely to happen the longer the Protoverse runs — thus, time-travel might be desired, too.

** Recursion Support
Deep recursion is likely going to play a key role, and should not have to be translated into imperative loops at the language level, but optimized by the actual compiler. "Never send a human to do a machine's job." --Agent Smith about TCO.

** Infinite Structures
I've got a feeling that infinite structures for data representation will be naturally pervasive in the Protoverse, and dealing with them natively will simplyfy certain things.

** Process Calculi
There's a huge range of process calculi: [[https://en.wikipedia.org/wiki/%CE%A0-calculus][π-calculus]], Stochastic π-calculus, Higher-order π-calculus, [[https://en.wikipedia.org/wiki/Ambient_calculus][Ambient calculus]], [[https://en.wikipedia.org/wiki/Join-calculus][Join calculus]], Psi-calculi, and many more.

It would be interesting if there's a functional language with a performant implementation of a process calculus in form of a library (e.g. embedded DSL); or at least having anonymous processes plus named (or typed) channels, which does't listen to the name "Golang").

The actor model is not exactly the same as a process calculus, because in the actor model, processes are /not anonymous/ and messages are adressed via process IDs. We could implement anonymous processes plus named (or typed) channels that can be passed around (π-calculus style channel-mobility) by a thin layer on top of an actor model implementation (e.g. some actors play channels, other actors play processes).

