blog/artificial-universe-engineering.project.html

<div id="outline-container-orgc13a6b9" class="outline-3">
<h3 id="orgc13a6b9"><a href="#orgc13a6b9">Build upon an Adopted, Adapted or Self-designed Process Calculus</a></h3>
<div class="outline-text-3" id="text-orgc13a6b9">
<p>
A newcomer on this list: As per my current understanding, designing the Process abstraction and dynamics would result in something like a <a href="https://en.wikipedia.org/wiki/Process_calculus">process calculus</a> anyway, just &ldquo;ad hoc, informally specified, bug-ridden and half-assed&rdquo;.<br>
</p>

<p>
I&rsquo;m aware that process calculi or algebras are considered models of computation &ldquo;for&rdquo; concurreny, but that&rsquo;s just one (albeit important) aspect &#x2013; even more interesting is that process calculi are existing formal systems to express process-relational dynamics. That&rsquo;s has strong DSL potential (there seem to be some implementations also).<br>
</p>

<p>
The idea is quite appealing, e.g. <a href="https://en.wikipedia.org/wiki/%CE%A0-calculus">π-calculus</a>: there are <i>anonymous processes</i> that communicate via named (or typed) channels. These channels can be passed around by processes through other channels, and this &ldquo;mobility&rdquo; allows dynamic reconfiguration of the process network. Processes can be composed into larger ones, which maps to the idea of &ldquo;higher-order&rdquo; Protoverse Processes. Channels might represent various &ldquo;dimensions&rdquo; for newly evolved means of relations (and interactions) of higher-order Processes.<br>
</p>

<p>
There&rsquo;s a chance that I might conflate something and be mistaken with what I said above, since I&rsquo;ve looked into process calculi only superficially as of yet. Before deep-diving, it seems rather sensible to advance the design of the Process abstraction by own reasoning first, and reconcile afterwards.<br>
</p>
</div>

<div id="outline-container-org1515be5" class="outline-4">
<h4 id="org1515be5"><a href="#org1515be5">Bigraphs</a></h4>
<div class="outline-text-4" id="text-org1515be5">
<p>
Today I learned that the idea above, using channels like &ldquo;dimensions&rdquo; seems to be the gist of <i>bigraphs</i>, modeling both the connectivity between processes (communication links) and their placement within a spatial or hierarchical context separately (location). My intuition says that there wouldn&rsquo;t be two distinct entities neccessary, because uniform (but typed?) channels could also represent hierarchical contexts &#x2013; but I may be confusing things here.<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org659519e" class="outline-3">
<h3 id="org659519e"><a href="#org659519e">&#x2026; Better Ideas?</a></h3>
<div class="outline-text-3" id="text-org659519e">
<p>
Let me know what you think. It would be great to juggle ideas, different points of view and fresh input.<br>
</p>
</div>
</div>
</div>

<div id="outline-container-orgfb40a23" class="outline-2">
<h2 id="orgfb40a23"><a href="#orgfb40a23">Requirements</a></h2>
<div class="outline-text-2" id="text-orgfb40a23">
</div>
<div id="outline-container-org805ebe7" class="outline-3">
<h3 id="org805ebe7"><a href="#org805ebe7">From Metaphysics to Code</a></h3>
<div class="outline-text-3" id="text-org805ebe7">
<p>
To minimize context switching, the core langage should enable expressing the <a href="artificial-universe-metaphysics.project.html">fundamental dynamics</a> closely and natively. A <a href="https://en.wikipedia.org/wiki/Purely_functional_programming">functional</a> general-purpose language with metaprogramming and a flexible concurrency story in combination with bottom-up <a href="https://en.wikipedia.org/wiki/Logic_programming">logic programming</a> might go a long way.<br>
</p>
</div>
</div>

<div id="outline-container-org9aee9a2" class="outline-3">
<h3 id="org9aee9a2"><a href="#org9aee9a2">Creation and Use of Embedded DSLs</a></h3>
<div class="outline-text-3" id="text-org9aee9a2">
<p>
It might be wishful thinking to achieve a close fit between code and the process-relational worldview with a general-purpose programming language alone. It&rsquo;s deemed necessary that unprecedented abstractions (e.g. a process calculus) can be created on top without hindrance, in form of a embedded DSL. Pivoting into different directions must be feasible (emphasis on refactoring capabilities and rather general primitives).<br>
</p>
</div>
</div>

<div id="outline-container-org8e5fa14" class="outline-3">
<h3 id="org8e5fa14"><a href="#org8e5fa14">Exploratory Programming</a></h3>
<div class="outline-text-3" id="text-org8e5fa14">
<p>
There will be no formal specification before the actual code, hence an exploratory programming style seems like the sanest approach for modeling. That sets the focus on primarily interactive use of language/platform.<br>
</p>
</div>
</div>

<div id="outline-container-orgefcfc9f" class="outline-3">
<h3 id="orgefcfc9f"><a href="#orgefcfc9f">Live Coding</a></h3>
<div class="outline-text-3" id="text-orgefcfc9f">
<p>
The programming environment/language should support conversational programming with the running live system. At this point, it&rsquo;s unclear how important this actually could become, relative to the tradeoffs &#x2013; because it greatly limits the number of potential programming languages. Further, increasingly interesting events are likely to happen the longer the Protoverse runs — thus, time-travel might be desired, too.<br>
</p>
</div>
</div>

<div id="outline-container-org3e0d56b" class="outline-3">
<h3 id="org3e0d56b"><a href="#org3e0d56b">Recursion Support</a></h3>
<div class="outline-text-3" id="text-org3e0d56b">
<p>
Deep recursion is likely going to play a key role, and should not have to be translated into imperative loops at the language level, but optimized by the actual compiler. &ldquo;Never send a human to do a machine&rsquo;s job.&rdquo; &#x2013;Agent Smith about TCO.<br>
</p>
</div>
</div>

<div id="outline-container-orga3adb43" class="outline-3">
<h3 id="orga3adb43"><a href="#orga3adb43">Infinite Structures</a></h3>
<div class="outline-text-3" id="text-orga3adb43">
<p>
I&rsquo;ve got a feeling that infinite structures for data representation will be naturally pervasive in the Protoverse, and dealing with them natively will simplyfy certain things.<br>
</p>
</div>
</div>

<div id="outline-container-org585fabb" class="outline-3">
<h3 id="org585fabb"><a href="#org585fabb">Process Calculi</a></h3>
<div class="outline-text-3" id="text-org585fabb">
<p>
There&rsquo;s a huge range of process calculi: <a href="https://en.wikipedia.org/wiki/%CE%A0-calculus">π-calculus</a>, Stochastic π-calculus, Higher-order π-calculus, <a href="https://en.wikipedia.org/wiki/Ambient_calculus">Ambient calculus</a>, <a href="https://en.wikipedia.org/wiki/Join-calculus">Join calculus</a>, Psi-calculi, and many more.<br>
</p>

<p>
It would be interesting if there&rsquo;s a functional language with a performant implementation of a process calculus in form of a library (e.g. embedded DSL); or at least having anonymous processes plus named (or typed) channels, which does&rsquo;t listen to the name &ldquo;Golang&rdquo;).<br>
</p>

<p>
The actor model is not exactly the same as a process calculus, because in the actor model, processes are <i>not anonymous</i> and messages are adressed via process IDs. We could implement anonymous processes plus named (or typed) channels that can be passed around (π-calculus style channel-mobility) by a thin layer on top of an actor model implementation (e.g. some actors play channels, other actors play processes).<br>
</p>
</div>
</div>
