blog/artificial-universe-engineering.project.org
** Concurrency
In the Protoverse, a lot of stuff is going to happen concurrently; millions and later probably billions of smallish concurrent computations are to be expected.

The idea is that Protoverse Processes and the underlying runtime lightweight processes are mapped one-to-one, while the lightweight processes are then multiplexed to OS-threads.

The runtime capability is an important factor: we might need something along the lines of lightweight processes, each with their own memory and garbage collector. And there comes up the the question wich type of scheduler -- cooperative or preemptive?

/All abstractions are leaky/. No system -- whether a formal system in logic ([[https://en.wikipedia.org/wiki/G%C3%B6del%27s_incompleteness_theorems][Goedel's incompleteness]]) or an abstraction in software ([[https://en.wikipedia.org/wiki/Leaky_abstraction][Spolsky's law]]) -- can be both complete and self-contained without any reference to or dependency on an outside or lower-level system.

A /preemptive scheduler/ is in control of the execution order and time slices for each process. Philosophically, this is analogous to a externally governed universe where processes do not have autonomy over their execution. A preemptive scheduler is great for performance, but it seems to impose a sort of "divine control" over the processes. Principally, there should be neither god, nor gardener in the Protoverse.

One way could be to let a preemptive scheduler do its thing, providing a reliable runtime, while Protoverse Processes must not be aware of the preemptive scheduler. The Protoverse Processes are solely governed by their own dynamics; that includes their own "scheduling".

Hence we would have to manage the risks of the runtime scheduler leaking into the Protoverse abstraction by careful encapsulation. The Protoverse should interact with the scheduler only through well-defined interfaces, such as process creation and message passing primitives.

But ... maybe do exactly the opposite: embrace the leakiness? It would be an interface to the "real world" limited by it's one truely limited resource -- the one that makes all the others /seem/ limited -- time. It's an experiment, after all?

On the other hand, I don't want "limited resources" as the major "selective pressure" for evolution. But maybe, it's rather the question of /how/ Processes co-evolve in the presence of limited resources, along other selectors. It doesn't have to lead to mayhem, war and suffering? Or does it, inevitably? /If this sounds nuts to you: Processes are subject to darwin-style evolution after all (potential artificial life), and we'll have to take ethical consideration into account./

As of now, I prefer a low-leaking variant with a preemptive runtime scheduler, and separate Protoverse "scheduling" that happens along relative dynamics between Processes. As long as the other selective criteria weigh more than the potential leak-through of the runtime scheduler, it might be fine.

** Parallelism
Introducing thread-based parallelism won't make this effect go away. A scheduler will be necessary still, because the number of lightweight processes likely outstrip the available CPU or GPU cores -- it's just a gradual reduction by introducing another level.

That's also the case when we think about vectorization "parallelism" (that involves performing /the same operation/ on multiple elements of a collection simultaneously, without explicitly iterating over the elements; vectorization may be implemented in a way that can leverage parallel computing resources).

The question would be, if computing (primitive) Protoverse Processes will fit to that. But as long as we don't have worked out the Process abstraction in detail, it makes not much sense to ponder on that.

** OpenCL or CUDA Bindings
The infrastructure may have to support parallelization at the hardware-level; for that, solid/straightforward C/C++ interop may be required.

** Interfacing With other Ecosystems
A language with a bigger ecosystem should be in direct reach, either by building on that platform (e.g. Erlang/BEAM or Java/JVM), or via seamless integration of others. This might be useful in terms of analysis, visualization, measuring or specific scientific libraries. Possible targets are C/C++, Java, Erlang or Python.

** Visualization, Analysis and Profiling
Visualization seems quite complicated stuff, so there should be (ideally native) frameworks/libraries available. Same for performance profiling and tweaking, which is often readily available when building on top of a platform that's built around a virtual machine.

** Scaling
First and foremost, the prevalent status will be "under development" rather then "in production". The scaling model depends on  the principal modus operandi of the Protoverse:

- *Batch-processing:* An exponentially and infinitely growing Protoverse could translate into a "big-bang" computation. That one maybe runs for a few minutes or hours, with subsequent analysis. This approach leans toward vertical scaling, throwing more powerful hardware on it, e.g. GPU arrays.

- *Long-running:* A cyclic or oscillating modus operandi might be much more interesting. The Protoverse would then be a long-running app, that calls for interaction and live-coding at the running system as the primary way of development, ongoing maintenance, and different scaling models.

** Distributed Computing
I lean towards a distributed, horizontal scaling model with independent P2P instances that could run in principle on conventional computers (and GPU-arrays). Well, maybe that's a bit too conservative: to leverage potentially infinite computing power, the Protoverse may eventually establish a mesh of Matrioshka brains that aims to encompass nearby stars. Ok, that's much better.

** Fault tolerance
That's predominantly a requirement for long-running, distributed systems and infrastructure -- when other stuff depends on it. Hence, fault-tolerance gets rather important with the long-running approach.

** Pruning and Data Compression
I'll have to consider memory-saving optimization techniques earlier in the development process; also taking into consideration, how much of Protoverse history will have to be kept around for analysis.

Resource-saving would play a much greater role if he Protoverse would be a long-running system. Maybe there would be intrinsic selection that effectively prunes emergent nested Scales when it is absolutely certain that nothing interesting happens at these; e.g. when they turn out random and too boring. However, intrinsic evolutionary dynamics are prior to interventions from the outside.

