blog/artificial-universe-engineering.project.html

<div id="outline-container-org0226302" class="outline-3">
<h3 id="org0226302"><a href="#org0226302">Concurrency</a></h3>
<div class="outline-text-3" id="text-org0226302">
<p>
In the Protoverse, a lot of stuff is going to happen concurrently; millions and later probably billions of smallish concurrent computations are to be expected.<br>
</p>

<p>
The idea is that Protoverse Processes and the underlying runtime lightweight processes are mapped one-to-one, while the lightweight processes are then multiplexed to OS-threads.<br>
</p>

<p>
The runtime capability is an important factor: we might need something along the lines of lightweight processes, each with their own memory and garbage collector. And there comes up the the question wich type of scheduler &#x2013; cooperative or preemptive?<br>
</p>

<p>
<i>All abstractions are leaky</i>. No system &#x2013; whether a formal system in logic (<a href="https://en.wikipedia.org/wiki/G%C3%B6del%27s_incompleteness_theorems">Goedel&rsquo;s incompleteness</a>) or an abstraction in software (<a href="https://en.wikipedia.org/wiki/Leaky_abstraction">Spolsky&rsquo;s law</a>) &#x2013; can be both complete and self-contained without any reference to or dependency on an outside or lower-level system.<br>
</p>

<p>
A <i>preemptive scheduler</i> is in control of the execution order and time slices for each process. Philosophically, this is analogous to a externally governed universe where processes do not have autonomy over their execution. A preemptive scheduler is great for performance, but it seems to impose a sort of &ldquo;divine control&rdquo; over the processes. Principally, there should be neither god, nor gardener in the Protoverse.<br>
</p>

<p>
One way could be to let a preemptive scheduler do its thing, providing a reliable runtime, while Protoverse Processes must not be aware of the preemptive scheduler. The Protoverse Processes are solely governed by their own dynamics; that includes their own &ldquo;scheduling&rdquo;.<br>
</p>

<p>
Hence we would have to manage the risks of the runtime scheduler leaking into the Protoverse abstraction by careful encapsulation. The Protoverse should interact with the scheduler only through well-defined interfaces, such as process creation and message passing primitives.<br>
</p>

<p>
But &#x2026; maybe do exactly the opposite: embrace the leakiness? It would be an interface to the &ldquo;real world&rdquo; limited by it&rsquo;s one truely limited resource &#x2013; the one that makes all the others <i>seem</i> limited &#x2013; time. It&rsquo;s an experiment, after all?<br>
</p>

<p>
On the other hand, I don&rsquo;t want &ldquo;limited resources&rdquo; as the major &ldquo;selective pressure&rdquo; for evolution. But maybe, it&rsquo;s rather the question of <i>how</i> Processes co-evolve in the presence of limited resources, along other selectors. It doesn&rsquo;t have to lead to mayhem, war and suffering? Or does it, inevitably? <i>If this sounds nuts to you: Processes are subject to darwin-style evolution after all (potential artificial life), and we&rsquo;ll have to take ethical consideration into account.</i><br>
</p>

<p>
As of now, I prefer a low-leaking variant with a preemptive runtime scheduler, and separate Protoverse &ldquo;scheduling&rdquo; that happens along relative dynamics between Processes. As long as the other selective criteria weigh more than the potential leak-through of the runtime scheduler, it might be fine.<br>
</p>
</div>
</div>

<div id="outline-container-org8577188" class="outline-3">
<h3 id="org8577188"><a href="#org8577188">Parallelism</a></h3>
<div class="outline-text-3" id="text-org8577188">
<p>
Introducing thread-based parallelism won&rsquo;t make this effect go away. A scheduler will be necessary still, because the number of lightweight processes likely outstrip the available CPU or GPU cores &#x2013; it&rsquo;s just a gradual reduction by introducing another level.<br>
</p>

<p>
That&rsquo;s also the case when we think about vectorization &ldquo;parallelism&rdquo; (that involves performing <i>the same operation</i> on multiple elements of a collection simultaneously, without explicitly iterating over the elements; vectorization may be implemented in a way that can leverage parallel computing resources).<br>
</p>

<p>
The question would be, if computing (primitive) Protoverse Processes will fit to that. But as long as we don&rsquo;t have worked out the Process abstraction in detail, it makes not much sense to ponder on that.<br>
</p>
</div>
</div>

<div id="outline-container-orgd86e030" class="outline-3">
<h3 id="orgd86e030"><a href="#orgd86e030">OpenCL or CUDA Bindings</a></h3>
<div class="outline-text-3" id="text-orgd86e030">
<p>
The infrastructure may have to support parallelization at the hardware-level; for that, solid/straightforward C/C++ interop may be required.<br>
</p>
</div>
</div>

<div id="outline-container-org80f629e" class="outline-3">
<h3 id="org80f629e"><a href="#org80f629e">Interfacing With other Ecosystems</a></h3>
<div class="outline-text-3" id="text-org80f629e">
<p>
A language with a bigger ecosystem should be in direct reach, either by building on that platform (e.g. Erlang/BEAM or Java/JVM), or via seamless integration of others. This might be useful in terms of analysis, visualization, measuring or specific scientific libraries. Possible targets are C/C++, Java, Erlang or Python.<br>
</p>
</div>
</div>

<div id="outline-container-orgad2d05f" class="outline-3">
<h3 id="orgad2d05f"><a href="#orgad2d05f">Visualization, Analysis and Profiling</a></h3>
<div class="outline-text-3" id="text-orgad2d05f">
<p>
Visualization seems quite complicated stuff, so there should be (ideally native) frameworks/libraries available. Same for performance profiling and tweaking, which is often readily available when building on top of a platform that&rsquo;s built around a virtual machine.<br>
</p>
</div>
</div>

<div id="outline-container-orge224263" class="outline-3">
<h3 id="orge224263"><a href="#orge224263">Scaling</a></h3>
<div class="outline-text-3" id="text-orge224263">
<p>
First and foremost, the prevalent status will be &ldquo;under development&rdquo; rather then &ldquo;in production&rdquo;. The scaling model depends on  the principal modus operandi of the Protoverse:<br>
</p>

<ul class="org-ul">
<li><b>Batch-processing:</b> An exponentially and infinitely growing Protoverse could translate into a &ldquo;big-bang&rdquo; computation. That one maybe runs for a few minutes or hours, with subsequent analysis. This approach leans toward vertical scaling, throwing more powerful hardware on it, e.g. GPU arrays.<br></li>

<li><b>Long-running:</b> A cyclic or oscillating modus operandi might be much more interesting. The Protoverse would then be a long-running app, that calls for interaction and live-coding at the running system as the primary way of development, ongoing maintenance, and different scaling models.<br></li>
</ul>
</div>
</div>

<div id="outline-container-org34a2894" class="outline-3">
<h3 id="org34a2894"><a href="#org34a2894">Distributed Computing</a></h3>
<div class="outline-text-3" id="text-org34a2894">
<p>
I lean towards a distributed, horizontal scaling model with independent P2P instances that could run in principle on conventional computers (and GPU-arrays). Well, maybe that&rsquo;s a bit too conservative: to leverage potentially infinite computing power, the Protoverse may eventually establish a mesh of Matrioshka brains that aims to encompass nearby stars. Ok, that&rsquo;s much better.<br>
</p>
</div>
</div>

<div id="outline-container-org15ad55d" class="outline-3">
<h3 id="org15ad55d"><a href="#org15ad55d">Fault tolerance</a></h3>
<div class="outline-text-3" id="text-org15ad55d">
<p>
That&rsquo;s predominantly a requirement for long-running, distributed systems and infrastructure &#x2013; when other stuff depends on it. Hence, fault-tolerance gets rather important with the long-running approach.<br>
</p>
</div>
</div>

<div id="outline-container-orgb3d730c" class="outline-3">
<h3 id="orgb3d730c"><a href="#orgb3d730c">Pruning and Data Compression</a></h3>
<div class="outline-text-3" id="text-orgb3d730c">
<p>
I&rsquo;ll have to consider memory-saving optimization techniques earlier in the development process; also taking into consideration, how much of Protoverse history will have to be kept around for analysis.<br>
</p>

<p>
Resource-saving would play a much greater role if he Protoverse would be a long-running system. Maybe there would be intrinsic selection that effectively prunes emergent nested Scales when it is absolutely certain that nothing interesting happens at these; e.g. when they turn out random and too boring. However, intrinsic evolutionary dynamics are prior to interventions from the outside.<br>
</p>
</div>
</div>
