blog/artificial-universe-engineering.project.org
** Collaboration Opportunities
The choice of languages and frameworks plays a role in terms of collaboration, albeit not a huge one. There are collab opportunities across a wide range:

- Computational philosophy, ethics
- Evolutionary biology, ALife community
- Complex systems, chaos theory, game theory
- Quantum theory: loop quantum gravity, relational quantum mechanics
- Modeling: process calculi/algebras, DSLs, meta-programming
- Engineering: performance, parallelism, OpenCL or CUDA
- Scaling and infrastructure: distributed systems, P2P networking


* Core Programming Language

This assessment is about the language suitable for modeling the Protoverse dynamics. The ranking reflects the requirements based on my current understanding:

** 1. Erlang: Elixir
   - Small, functional language with pervasive pattern matching (like OCaml)
   - Built around the actor model for concurrency, but that's also interesting for modeling -- it's no process calculus though, so no anonymous processes and channels;
   - Hot swapping: support for upgrading the running sytem, but seems complicated and not a method for for shortening the development cycle;
   - Elixir REPL can connect to a running app;
   - Makes extensive use of metaprogramming in Elixir's implementation and Phoenix;
   - Gradually typed language "set-theoretic types" (?);
   - Full support for distributed architectures, fault-tolerance built-in;
   - No Devops mess -- all that stuff can be avoided;
   - BEAM with Erlang Platform has profilers and analysis tools
   - Live visualization, plotting etc. seems under-represented
   - Collab opportunities: very engaged community, pragmatic, focus on web backend, infrastructure, engineering mindset, and a bit of machine learning;

** 2. Haskell
   - Functional language;
   - No support to modify a program while running, only REPL (what about [[https://hackage.haskell.org/package/rapid][rapid]]?);
   - Non-strict evaluation is elegant, simplifies handling of infinite structures, but lazyness is available in other languages too;
   - Static typing helps refactoring and documentation, type system is great for modelling, no ML-style modules but typeclasses;
   - Concurrency: [[http://haskell-distributed.github.io/documentation.html#concurrency-and-distribution][Cloud haskell]] allows message passing using [[https://haskell-distributed.github.io/documentation.html#typed-channels][typed channels]], where the SendPort of a channel can be passed to other processes via message; processes don't share state;
   - Purely Functional code is good for parallelization (in principle);
   - Collab opportunities: engaged community, FP-enthusiasts;

** 3. OCaml
   - Functional language with pervasive pattern matching
   - There has been a [[https://www.ocamlwiki.com/wiki/Join_calculus][process calculus]] implemented in OCaml, but abandoned; 
   - Cannot connect to or modify a running program, only in the REPL;
   - Static type system makes refactoring fun and documentation effective, type system is great for modeling;
   - Concurrency:  [[https://ocaml.org/p/lwt/latest][Lwt]]: each light-weight process has its own stack and can maintain its own state; uses promises and cooperative scheduling, preemptive threads are possible too but based on OS threads; how can it handle millions of concurrent threads?
   - [[http://ocamlverse.net/content/parallelism.html#domain-thread-based-parallelism][Parallelism since 5.0]] using domainslib
   - Overall very performant, super fast compiler
   - MirageOS (microkernel operating system) for deployment of P2P nodes
   - Colaboration opportunities: engaged community, language ecosystem under active development, FP-pragmatics;
     
** 4. Common Lisp (SBCL)
   - Supports functional programming and logic programming, anything goes;
   - Pattern matching via Trivia library
   - Very moldable to the domain via metaprogramming (DSLs, e.g. see [[https://coalton-lang.github.io/post/][Coalton]]);
   - Algebraic data types available, and there is also [[https://github.com/coalton-lang/coalton][Coalton]], an ML-style, internal DSL with type classes);
   - Conversational programming at the running system is great for prototyping/exploration;
   - The running program can be paused, debugged, modified and continued without losing state;
   - The state of a running immage can be dumped and restored, but that won't work out-of-the box for a distributed system;
   - Concurrency: [[https://github.com/mdbergmann/cl-gserver][Sento]] actor framework ([[https://mdbergmann.github.io/cl-gserver/index.html][documentation]])
   - Not so polished for parallelism, distributed computing and fault tolerance in comparison to the other contenders;
   - Low-level access to the language itself, plenty of optimizations;
   - SBCL is performant (Java ballpark);
   - Collab opportunities: Community is diverse yet enthusiastic, fanatics also, fragemented, less collaborative (many one-person-projects rather than common goals realized);

** 5. Julia
   - Functional programming is not idiomatic and I'm not used to that;
   - I expect extensive use of deep recursion — but Julia seems not to respect tail-calls and may not optimize (?);
   - Pattern matching is available via Match.jl and MLStyle libraries;
   - Metaprogramming is available
   - A running program can be debugged and modified, new functions can be defined and added (with caveats; not as extensively as in Common Lisp);
   - Dynamic typing, but allows type annotations (mostly for performance reasons);
   - Parallel and distributed computing out-of-the-box, but no fault-tolerance;
   - Shiny convenience libraries for all kinds of stuff;
   - Direct calling of C functions and access to Python libraries;
   - Low-level access to the language itself;
   - Collab opportunities: data-, science and simulation folks of all sorts;

** 6. Clojure
   - Functional paradigm, lazy sequences;
   - No TCO, but acknowledged by `recur' workaround;
   - Interactive and live-coding, working at the running program;
   - Has metaprogramming, but that is rather discouraged;
   - Optional type system Core.Typed (?)
   - Clojure.Spec isn't a type system but for runtime validation;
   - Concurrency: the features of [[https://www.youtube.com/watch?v=yJxFPoxqzWE][Core.Async]] are somewhere between [[https://en.wikipedia.org/wiki/Communicating_sequential_processes][CSP]] and [[https://en.wikipedia.org/wiki/%CE%A0-calculus][π-calculus]]; it allows channels to be passed as values; but memory is shared (unlike Erlang, for instance);
   - JVM wit Java is a scalable platform with profilers and tools;
   - Collab opportunities: broad and diverse, business-oriented community;
