blog/artificial-universe-engineering.project.html

<div id="outline-container-orgdabdc7c" class="outline-3">
<h3 id="orgdabdc7c"><a href="#orgdabdc7c">Collaboration Opportunities</a></h3>
<div class="outline-text-3" id="text-orgdabdc7c">
<p>
The choice of languages and frameworks plays a role in terms of collaboration, albeit not a huge one. There are collab opportunities across a wide range:<br>
</p>

<ul class="org-ul">
<li>Computational philosophy, ethics<br></li>
<li>Evolutionary biology, ALife community<br></li>
<li>Complex systems, chaos theory, game theory<br></li>
<li>Quantum theory: loop quantum gravity, relational quantum mechanics<br></li>
<li>Modeling: process calculi/algebras, DSLs, meta-programming<br></li>
<li>Engineering: performance, parallelism, OpenCL or CUDA<br></li>
<li>Scaling and infrastructure: distributed systems, P2P networking<br></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org0f7d4fd" class="outline-2">
<h2 id="org0f7d4fd"><a href="#org0f7d4fd">Core Programming Language</a></h2>
<div class="outline-text-2" id="text-org0f7d4fd">
<p>
This assessment is about the language suitable for modeling the Protoverse dynamics. The ranking reflects the requirements based on my current understanding:<br>
</p>
</div>

<div id="outline-container-org4eea73e" class="outline-3">
<h3 id="org4eea73e"><a href="#org4eea73e">1. Erlang: Elixir</a></h3>
<div class="outline-text-3" id="text-org4eea73e">
<ul class="org-ul">
<li>Small, functional language with pervasive pattern matching (like OCaml)<br></li>
<li>Built around the actor model for concurrency, but that&rsquo;s also interesting for modeling &#x2013; it&rsquo;s no process calculus though, so no anonymous processes and channels;<br></li>
<li>Hot swapping: support for upgrading the running sytem, but seems complicated and not a method for for shortening the development cycle;<br></li>
<li>Elixir REPL can connect to a running app;<br></li>
<li>Makes extensive use of metaprogramming in Elixir&rsquo;s implementation and Phoenix;<br></li>
<li>Gradually typed language &ldquo;set-theoretic types&rdquo; (?);<br></li>
<li>Full support for distributed architectures, fault-tolerance built-in;<br></li>
<li>No Devops mess &#x2013; all that stuff can be avoided;<br></li>
<li>BEAM with Erlang Platform has profilers and analysis tools<br></li>
<li>Live visualization, plotting etc. seems under-represented<br></li>
<li>Collab opportunities: very engaged community, pragmatic, focus on web backend, infrastructure, engineering mindset, and a bit of machine learning;<br></li>
</ul>
</div>
</div>

<div id="outline-container-org551e15b" class="outline-3">
<h3 id="org551e15b"><a href="#org551e15b">2. Haskell</a></h3>
<div class="outline-text-3" id="text-org551e15b">
<ul class="org-ul">
<li>Functional language;<br></li>
<li>No support to modify a program while running, only REPL (what about <a href="https://hackage.haskell.org/package/rapid">rapid</a>?);<br></li>
<li>Non-strict evaluation is elegant, simplifies handling of infinite structures, but lazyness is available in other languages too;<br></li>
<li>Static typing helps refactoring and documentation, type system is great for modelling, no ML-style modules but typeclasses;<br></li>
<li>Concurrency: <a href="http://haskell-distributed.github.io/documentation.html#concurrency-and-distribution">Cloud haskell</a> allows message passing using <a href="https://haskell-distributed.github.io/documentation.html#typed-channels">typed channels</a>, where the SendPort of a channel can be passed to other processes via message; processes don&rsquo;t share state;<br></li>
<li>Purely Functional code is good for parallelization (in principle);<br></li>
<li>Collab opportunities: engaged community, FP-enthusiasts;<br></li>
</ul>
</div>
</div>

<div id="outline-container-org8509f78" class="outline-3">
<h3 id="org8509f78"><a href="#org8509f78">3. OCaml</a></h3>
<div class="outline-text-3" id="text-org8509f78">
<ul class="org-ul">
<li>Functional language with pervasive pattern matching<br></li>
<li>There has been a <a href="https://www.ocamlwiki.com/wiki/Join_calculus">process calculus</a> implemented in OCaml, but abandoned;<br></li>
<li>Cannot connect to or modify a running program, only in the REPL;<br></li>
<li>Static type system makes refactoring fun and documentation effective, type system is great for modeling;<br></li>
<li>Concurrency:  <a href="https://ocaml.org/p/lwt/latest">Lwt</a>: each light-weight process has its own stack and can maintain its own state; uses promises and cooperative scheduling, preemptive threads are possible too but based on OS threads; how can it handle millions of concurrent threads?<br></li>
<li><a href="http://ocamlverse.net/content/parallelism.html#domain-thread-based-parallelism">Parallelism since 5.0</a> using domainslib<br></li>
<li>Overall very performant, super fast compiler<br></li>
<li>MirageOS (microkernel operating system) for deployment of P2P nodes<br></li>
<li>Colaboration opportunities: engaged community, language ecosystem under active development, FP-pragmatics;<br></li>
</ul>
</div>
</div>

<div id="outline-container-orgd91d60c" class="outline-3">
<h3 id="orgd91d60c"><a href="#orgd91d60c">4. Common Lisp (SBCL)</a></h3>
<div class="outline-text-3" id="text-orgd91d60c">
<ul class="org-ul">
<li>Supports functional programming and logic programming, anything goes;<br></li>
<li>Pattern matching via Trivia library<br></li>
<li>Very moldable to the domain via metaprogramming (DSLs, e.g. see <a href="https://coalton-lang.github.io/post/">Coalton</a>);<br></li>
<li>Algebraic data types available, and there is also <a href="https://github.com/coalton-lang/coalton">Coalton</a>, an ML-style, internal DSL with type classes);<br></li>
<li>Conversational programming at the running system is great for prototyping/exploration;<br></li>
<li>The running program can be paused, debugged, modified and continued without losing state;<br></li>
<li>The state of a running immage can be dumped and restored, but that won&rsquo;t work out-of-the box for a distributed system;<br></li>
<li>Concurrency: <a href="https://github.com/mdbergmann/cl-gserver">Sento</a> actor framework (<a href="https://mdbergmann.github.io/cl-gserver/index.html">documentation</a>)<br></li>
<li>Not so polished for parallelism, distributed computing and fault tolerance in comparison to the other contenders;<br></li>
<li>Low-level access to the language itself, plenty of optimizations;<br></li>
<li>SBCL is performant (Java ballpark);<br></li>
<li>Collab opportunities: Community is diverse yet enthusiastic, fanatics also, fragemented, less collaborative (many one-person-projects rather than common goals realized);<br></li>
</ul>
</div>
</div>

<div id="outline-container-orgc4a12a6" class="outline-3">
<h3 id="orgc4a12a6"><a href="#orgc4a12a6">5. Julia</a></h3>
<div class="outline-text-3" id="text-orgc4a12a6">
<ul class="org-ul">
<li>Functional programming is not idiomatic and I&rsquo;m not used to that;<br></li>
<li>I expect extensive use of deep recursion — but Julia seems not to respect tail-calls and may not optimize (?);<br></li>
<li>Pattern matching is available via Match.jl and MLStyle libraries;<br></li>
<li>Metaprogramming is available<br></li>
<li>A running program can be debugged and modified, new functions can be defined and added (with caveats; not as extensively as in Common Lisp);<br></li>
<li>Dynamic typing, but allows type annotations (mostly for performance reasons);<br></li>
<li>Parallel and distributed computing out-of-the-box, but no fault-tolerance;<br></li>
<li>Shiny convenience libraries for all kinds of stuff;<br></li>
<li>Direct calling of C functions and access to Python libraries;<br></li>
<li>Low-level access to the language itself;<br></li>
<li>Collab opportunities: data-, science and simulation folks of all sorts;<br></li>
</ul>
</div>
</div>

<div id="outline-container-org42fef09" class="outline-3">
<h3 id="org42fef09"><a href="#org42fef09">6. Clojure</a></h3>
<div class="outline-text-3" id="text-org42fef09">
<ul class="org-ul">
<li>Functional paradigm, lazy sequences;<br></li>
<li>No TCO, but acknowledged by `recur&rsquo; workaround;<br></li>
<li>Interactive and live-coding, working at the running program;<br></li>
<li>Has metaprogramming, but that is rather discouraged;<br></li>
<li>Optional type system Core.Typed (?)<br></li>
<li>Clojure.Spec isn&rsquo;t a type system but for runtime validation;<br></li>
<li>Concurrency: the features of <a href="https://www.youtube.com/watch?v=yJxFPoxqzWE">Core.Async</a> are somewhere between <a href="https://en.wikipedia.org/wiki/Communicating_sequential_processes">CSP</a> and <a href="https://en.wikipedia.org/wiki/%CE%A0-calculus">π-calculus</a>; it allows channels to be passed as values; but memory is shared (unlike Erlang, for instance);<br></li>
<li>JVM wit Java is a scalable platform with profilers and tools;<br></li>
<li>Collab opportunities: broad and diverse, business-oriented community;<br></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author">Dan Dee</span> <span class="email"><a href="mailto:MonkeyJungleJuice@pm.me">MonkeyJungleJuice@pm.me</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
